Revit 2024 API
BuiltInFailures.BendFailures.NotBentImport Property
 While making curved beam type "[Type Name]" CAD File elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentImport { get; }
Visual Basic
Public Shared ReadOnly Property NotBentImport As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentImport {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace